Revit 2027 API
GeometryElement.GetEnumeratorNG Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
internal IEnumerator GetEnumeratorNG()
Friend Function GetEnumeratorNG As IEnumerator
internal:
virtual IEnumerator^ GetEnumeratorNG() sealed
internal abstract GetEnumeratorNG : unit -> IEnumerator
internal override GetEnumeratorNG : unit -> IEnumerator
Return Value
IEnumerator
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace